#!/bin/sh
echo "=================================================="
echo "🔴 АЛХАМ 1: Хуучин Node 16 дээр ажиллуулж байна..."
echo "=================================================="
docker run --rm -v "$PWD":/app -w /app node:16-alpine node src/check.js
echo ""
echo "=================================================="
echo "🟢 АЛХАМ 2: Шинэ Node 24 дээр ажиллуулж байна..."
echo "=================================================="
docker run --rm -v "$PWD":/app -w /app node:24-alpine node src/check.js
